{
  "resume": {
    "name": "Wilson Chen",
    "title": "Wilson Chen's Resume",
    "position": "Software Engineer",
    "location": "Taipei City, Taiwan",
    "experience": "Work & Experience",
    "dayMode": "Day Mode",
    "nightMode": "Night Mode",
    "home": "Home",
    "workTitle1": "Back-End Engineer",
    "company1": "Work on a piecework basis",
    "timeRanges1": "Jun 2023 - Oct 2023",
    "skillsContext1": "Skills and tools:",
    "skills1": "docker, typescript, express.js, nginx, bun",
    "responsibilitiesContext1": "Main Responsibilities:",
    "responsibilities1": "Developed a backend for a web application that allows you to create and edit a list of tasks. The backend is written in TypeScript using the Express.js framework. The application is deployed on a server using Docker.",
    "workTitle2": "Front-End Engineer",
    "company2": "ByteXByte-Berify",
    "timeRanges2": "Nov 2022 - Apr 2023",
    "skillsContext2": "Skills and tools:",
    "skills2": "Next.js, react native, typescript, Swift, prisma, nginx, webpack, Aws, docker",
    "responsibilitiesContext2": "Main Responsibilities:",
    "responsibilities2": "Developed a web application for a company that provides services for the development of mobile applications. The application is written in TypeScript using the Next.js framework. The application is deployed on a server using Docker.",
    "achievementsSmaillTitle": "Involved in web architecture and design",
    "achievementsTitle": "My Responsibilities and Achievements",
    "achievementsContent1": "  When I first joined ByteXByte, I was primarily responsible for coordinating with UI designers from American companies. Based on the priorities, I collaborated with other engineers to complete new pages and features. Basic functions and interfaces were smoothly developed and delivered on time. A notable challenge I overcame was implementing real-time user registration status verification through sockets during independent user sign-up and login processes. After spending several days on this task, seeing the results gave me a great sense of accomplishment. Given that this project essentially involved controlling the app display through a web interface, and with the increasing volume of data, plus the requirement to create a superuser for the website, we discussed database schemas. Following that, I started with next's API. Through nextAuth, once I obtained the Session, I determined the data access permissions, then, in the frontend SSR props, I decided on the data to fetch from the backend and displayed various data based on permissions.",
    "achievementsContent2": "  During my tenure at this company, I had the opportunity to work on a project for Lamborghini where we installed our company's product on their official vehicles. Once scanned, the app would display the NFT Redemption status set on the website by the company. I participated in this project from its inception to its operational phase. After the website became stable, I shifted focus to Swift to adjust the NFC scanning to comply with the updated iOS standards and frontend display of scanning events.",
    "achievementsContent3": "  On the freelance side, I upgraded a Java Spring API server to a more versatile gateway. I used Express as the foundational framework and coded in TypeScript. With the comprehensive Axios ecosystem at my disposal, I modularized proxy and header functionalities. I plan to implement a class-based approach to allow any new service providers to swiftly construct dedicated services.",
    "footerTitle": "Let's keep in touch!",
    "footerContent": "If you have any questions, please feel free to contact me. cweihao2956@gmail.com",
    "usefulLinks": "Useful Links",
    "author":"Wilson Chen"
  }
}
